; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v7 ?v4)
             (pred_9 ?v12 ?v6)
             (pred_10 ?v7 ?v6)
             (pred_12 ?v9 ?v7 )
	     (pred_3 ?v7)
             (pred_11 ?v11)
             (pred_5 ?v12)
             (pred_6 ?v6)
             (pred_7 ?v7)
             (pred_4 ?v12)
             (pred_1 ?v7)
             (pred_8 ))



(:action op_1
:parameters (?v5 ?v3 ?v2 ?v10)
:precondition (and (pred_11 ?v5) (pred_11 ?v3) (pred_5 ?v2) (pred_6 ?v10)
          (pred_2 ?v5 ?v3) (pred_9 ?v2 ?v10)
                   (pred_10 ?v3 ?v10) (pred_3 ?v5) 
                   (pred_7 ?v3) (pred_4 ?v2))
:effect (and  (pred_1 ?v3) (not (pred_7 ?v3))))


(:action op_3
:parameters (?v5 ?v8)
:precondition (and (pred_11 ?v5) (pred_11 ?v8)
               (pred_3 ?v5) (pred_2 ?v5 ?v8) (pred_1 ?v8))
:effect (and (pred_3 ?v8) (not (pred_3 ?v5))))

(:action op_4
:parameters (?v5 ?v2)
:precondition (and (pred_11 ?v5) (pred_5 ?v2) 
                  (pred_3 ?v5) (pred_12 ?v2 ?v5) (pred_8 ))
:effect (and (pred_4 ?v2)
   (not (pred_12 ?v2 ?v5)) (not (pred_8 ))))


(:action op_5
:parameters (?v5 ?v1 ?v13)
:precondition (and (pred_11 ?v5) (pred_5 ?v1) (pred_5 ?v13)
                  (pred_3 ?v5) (pred_4 ?v13) (pred_12 ?v1 ?v5))
:effect (and (pred_4 ?v1) (pred_12 ?v13 ?v5)
        (not (pred_4 ?v13)) (not (pred_12 ?v1 ?v5))))

(:action op_2
:parameters (?v5 ?v2)
:precondition (and (pred_11 ?v5) (pred_5 ?v2) 
                  (pred_3 ?v5) (pred_4 ?v2))
:effect (and (pred_8 ) (pred_12 ?v2 ?v5) (not (pred_4 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_15 obj_26 obj_11 obj_04 obj_06 obj_07 obj_22 obj_12 obj_19 obj_03 obj_23 obj_16 obj_09 obj_08 obj_13 obj_21 obj_27 obj_18 obj_01 obj_24 obj_30 obj_05 obj_17 obj_25
    obj_02 obj_14 obj_29
    obj_28 obj_31 obj_20
    )

    (:init
       (pred_8)

       (pred_11 obj_10)
       (pred_11 obj_15)
       (pred_11 obj_26)
       (pred_11 obj_11)
       (pred_11 obj_04)
       (pred_11 obj_06)
       (pred_11 obj_07)
       (pred_11 obj_22)
       (pred_11 obj_12)
       (pred_11 obj_19)
       (pred_11 obj_03)
       (pred_11 obj_23)
       (pred_11 obj_16)
       (pred_11 obj_09)
       (pred_11 obj_08)
       (pred_11 obj_13)
       (pred_11 obj_21)
       (pred_11 obj_27)
       (pred_11 obj_18)
       (pred_11 obj_01)
       (pred_11 obj_24)
       (pred_11 obj_30)
       (pred_11 obj_05)
       (pred_11 obj_17)
       (pred_11 obj_25)
       (pred_6 obj_02)
       (pred_6 obj_14)
       (pred_6 obj_29)
       (pred_5 obj_28)
       (pred_5 obj_31)
       (pred_5 obj_20)

       (pred_2 obj_10 obj_06)
       (pred_2 obj_10 obj_15)
       (pred_2 obj_15 obj_07)
       (pred_2 obj_15 obj_26)
       (pred_2 obj_15 obj_10)
       (pred_2 obj_26 obj_22)
       (pred_2 obj_26 obj_11)
       (pred_2 obj_26 obj_15)
       (pred_2 obj_11 obj_12)
       (pred_2 obj_11 obj_04)
       (pred_2 obj_11 obj_26)
       (pred_2 obj_04 obj_19)
       (pred_2 obj_04 obj_11)
       (pred_2 obj_06 obj_03)
       (pred_2 obj_06 obj_07)
       (pred_2 obj_06 obj_10)
       (pred_2 obj_07 obj_23)
       (pred_2 obj_07 obj_22)
       (pred_2 obj_07 obj_15)
       (pred_2 obj_07 obj_06)
       (pred_2 obj_22 obj_16)
       (pred_2 obj_22 obj_12)
       (pred_2 obj_22 obj_26)
       (pred_2 obj_22 obj_07)
       (pred_2 obj_12 obj_09)
       (pred_2 obj_12 obj_19)
       (pred_2 obj_12 obj_11)
       (pred_2 obj_12 obj_22)
       (pred_2 obj_19 obj_08)
       (pred_2 obj_19 obj_04)
       (pred_2 obj_19 obj_12)
       (pred_2 obj_03 obj_13)
       (pred_2 obj_03 obj_23)
       (pred_2 obj_03 obj_06)
       (pred_2 obj_23 obj_21)
       (pred_2 obj_23 obj_16)
       (pred_2 obj_23 obj_07)
       (pred_2 obj_23 obj_03)
       (pred_2 obj_16 obj_27)
       (pred_2 obj_16 obj_09)
       (pred_2 obj_16 obj_22)
       (pred_2 obj_16 obj_23)
       (pred_2 obj_09 obj_18)
       (pred_2 obj_09 obj_08)
       (pred_2 obj_09 obj_12)
       (pred_2 obj_09 obj_16)
       (pred_2 obj_08 obj_01)
       (pred_2 obj_08 obj_19)
       (pred_2 obj_08 obj_09)
       (pred_2 obj_13 obj_24)
       (pred_2 obj_13 obj_21)
       (pred_2 obj_13 obj_03)
       (pred_2 obj_21 obj_30)
       (pred_2 obj_21 obj_27)
       (pred_2 obj_21 obj_23)
       (pred_2 obj_21 obj_13)
       (pred_2 obj_27 obj_05)
       (pred_2 obj_27 obj_18)
       (pred_2 obj_27 obj_16)
       (pred_2 obj_27 obj_21)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_18 obj_01)
       (pred_2 obj_18 obj_09)
       (pred_2 obj_18 obj_27)
       (pred_2 obj_01 obj_25)
       (pred_2 obj_01 obj_08)
       (pred_2 obj_01 obj_18)
       (pred_2 obj_24 obj_30)
       (pred_2 obj_24 obj_13)
       (pred_2 obj_30 obj_05)
       (pred_2 obj_30 obj_21)
       (pred_2 obj_30 obj_24)
       (pred_2 obj_05 obj_17)
       (pred_2 obj_05 obj_27)
       (pred_2 obj_05 obj_30)
       (pred_2 obj_17 obj_25)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_17 obj_05)
       (pred_2 obj_25 obj_01)
       (pred_2 obj_25 obj_17)
       (pred_7 obj_08)
       (pred_7 obj_03)
       (pred_7 obj_21)
       (pred_10  obj_08 obj_02)
       (pred_10  obj_03 obj_14)
       (pred_10  obj_21 obj_29)
       (pred_1 obj_10)
       (pred_1 obj_15)
       (pred_1 obj_26)
       (pred_1 obj_11)
       (pred_1 obj_04)
       (pred_1 obj_06)
       (pred_1 obj_07)
       (pred_1 obj_22)
       (pred_1 obj_12)
       (pred_1 obj_19)
       (pred_1 obj_23)
       (pred_1 obj_16)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_27)
       (pred_1 obj_18)
       (pred_1 obj_01)
       (pred_1 obj_24)
       (pred_1 obj_30)
       (pred_1 obj_05)
       (pred_1 obj_17)
       (pred_1 obj_25)

       (pred_9  obj_28 obj_02)
       (pred_9  obj_31 obj_14)
       (pred_9  obj_20 obj_29)
       (pred_12 obj_28 obj_15)
       (pred_12 obj_31 obj_19)
       (pred_12 obj_20 obj_26)
       (pred_3 obj_16)
    )

    (:goal (and
       (pred_12 obj_28 obj_13)
       (pred_12 obj_31 obj_26)
    ))
(:constraints
  (always (not (pred_3 obj_07)))
)
)

; plan
1. (op_3 obj_16 obj_22)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_22)
   goals met: 0 of 2
2. (op_3 obj_22 obj_12)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_12)
   goals met: 0 of 2
3. (op_3 obj_12 obj_19)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_19)
   goals met: 0 of 2
4. (op_4 obj_19 obj_31)
   deleted: (pred_12 obj_31 obj_19) (pred_8)
   added: (pred_4 obj_31)
   goals met: 0 of 2
5. (op_3 obj_19 obj_04)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_04)
   goals met: 0 of 2
6. (op_3 obj_04 obj_11)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_11)
   goals met: 0 of 2
7. (op_3 obj_11 obj_26)
   deleted: (pred_3 obj_11)
   added: (pred_3 obj_26)
   goals met: 0 of 2
8. (op_5 obj_26 obj_20 obj_31)
   deleted: (pred_4 obj_31) (pred_12 obj_20 obj_26)
   added: (pred_4 obj_20) (pred_12 obj_31 obj_26)
   goals met: 1 of 2
9. (op_3 obj_26 obj_15)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_15)
   goals met: 1 of 2
10. (op_5 obj_15 obj_28 obj_20)
   deleted: (pred_4 obj_20) (pred_12 obj_28 obj_15)
   added: (pred_4 obj_28) (pred_12 obj_20 obj_15)
   goals met: 1 of 2
11. (op_3 obj_15 obj_26)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_26)
   goals met: 1 of 2
12. (op_3 obj_26 obj_22)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_22)
   goals met: 1 of 2
13. (op_3 obj_22 obj_16)
   deleted: (pred_3 obj_22)
   added: (pred_3 obj_16)
   goals met: 1 of 2
14. (op_3 obj_16 obj_27)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_27)
   goals met: 1 of 2
15. (op_3 obj_27 obj_05)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_05)
   goals met: 1 of 2
16. (op_3 obj_05 obj_30)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_30)
   goals met: 1 of 2
17. (op_3 obj_30 obj_24)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_24)
   goals met: 1 of 2
18. (op_3 obj_24 obj_13)
   deleted: (pred_3 obj_24)
   added: (pred_3 obj_13)
   goals met: 1 of 2
19. (op_2 obj_13 obj_28)
   deleted: (pred_4 obj_28)
   added: (pred_8) (pred_12 obj_28 obj_13)
   goals met: 2 of 2
